[
  {
    "id": "1",
    "title": "Are credit cards (Master Card) widely accepted in Morocco (Fez, Marrakesh, Meknes, Ouarzazate)?",
    "content": "I am traveling to Fez, Marrakesh, Meknes and Ouarzazate. I hold a Mastercard (German bank). Are such credit cards accepted in the museums and restaurants in these cities? When used in a restaurant, is there a minimum amount you have to spend in order to pay by credit card?What about public transportation? Can I buy tickets for trains and buses (Supratours, CTM, ONCF) using Mastercard? Or should I carry cash all the time?",
    "tags": [
      "buses",
      "payment-cards",
      "restaurants",
      "morocco",
      "tourist-traps"
    ]
  },
  {
    "id": "2",
    "title": "Applying for German Schengen visa for several years' duration",
    "content": "I am thinking about applying for a Schengen visa for my next trip to Germany. Since I might be visiting Germany or other Schengen countries again in the next few years, I was wondering whether it would be worth trying to get a multiple-entry Schengen visa. Is there any risk/harm in checking the 'multiple entry' box on the form? And do I stand a reasonable chance to get such a visa? I've been in Germany last year for 3 months doing research at a university (on a single-entry tourist visa). For my next trip, I don't think I'll have anything more legitimate than casual tourism. A multiple-entry visa of duration 6 months or 1 year would not interest me much -- I'm unlikely to make multiple trips in that duration anyway. Something like 2-5 years would be useful for me. I've already read this question, but since my situation is more specific in a few aspects, I think it is worth asking my question here.",
    "tags": [
      "visas",
      "schengen",
      "germany"
    ]
  },
  {
    "id": "3",
    "title": "Is my brand new Indian passport damaged due to a loose thread in the middle of the booklet?",
    "content": "So basically I applied for a new passport and I got it two months ago. I was flipping through the pages a few days ago and I realized that there is a loose dangling thread in the lower part of the booklet if you look carefully. So far the passport is tight and is in mint condition but I want to know that if one stitch is broken, wouldn't all the stitches come out eventually? I'm worried as getting a passport in India can be a bit daunting due to police verification and overburdened administrative system and I don't want to go through the whole process again. So can I try my luck in travelling with this passport? Do you guys think it can survive for 10 years? I rarely take it outside of my folder but I'm worried that after a few visa stamps and a few more scans of this passport, all the stitches might come out. What should I do? Also can I apply for a student visa now with this passport? As the embassy and the immigration officers usually stretch out the entire booklet to put a stamp/visa on it will it make the threading even more loose? Maybe I'm overreacting on a tiny piece of loose thread but I would really like to hear your 2 cents on the condition of my passport.",
    "tags": [
      "customs-and-immigrations",
      "passports",
      "indian-citizens",
      "airports",
      "india"
    ]
  },
  {
    "id": "4",
    "title": "Where in Istanbul airport can I rent a portable 3G/LTE Wifi hotspot?",
    "content": "Since Turkey's mobile phone legislation is a pain in the ass, I'm considering renting a 3G/LTE Wifi hotspot on the two stopovers I will have there in February. Is there a company which could rent me one at Istanbul airport? If not, maybe I can find such a service in the center of the city? Technically I could just buy a sim-card and discard it later, but my 24-hour stopovers are over 3 weeks apart so it would be impossible for me to get Internet on the way back, since my IMEI would have been blocked by then.",
    "tags": [
      "turkey",
      "internet",
      "rental",
      "istanbul",
      "ist"
    ]
  },
  {
    "id": "5",
    "title": "Visa to visit Trinidad",
    "content": "Does an Indian citizen, living in Canada on a student permit, need a visa to visit Trinidad for a holiday?",
    "tags": [
      "visas",
      "indian-citizens",
      "canada",
      "study",
      "trinidad-and-tobago"
    ]
  }
]